<template>
  <div class="loginDeal">
    <div class="loginDealHeader">
      用户协议
    </div>
    <div class="loginDealContent">
      <p>
        用户在使用技术开发方（即本公司，以下统称“技术开发方”）提供的各项服务之前，应仔细阅读本《用户协议》（以下简称“本协议”）。用户一旦登录或使用技术开发方的服务，即视为用户已了解并明示同意协议各项内容，本协议立即在用户与本技术开发方之间产生法律效力。用户登录、使用本产品服务的全部活动将受到本协议的约束并承担相应的责任和义务。如用户不同意本协议任何内容的，请用户立即停止使用技术开发方所提供的全部服务。</p>
      <p>
        根据《中华人民共和国网络安全法》、《电信和互联网用户个人信息保护规定》及相关法律法规的规定，同时依据技术开发方与其合作伙伴之间的相关协议，用户必须已明示授权技术开发方合作伙伴（以下简称“合作伙伴”）在此明示授权并委托技术开发方及其关联公司通过官方或相关实名认证平台、信用信息平台（包括但不限于：征信机构、银行信用信息平台、网络借贷平台、消费金融平台、第三方支付平台等）及其他相关平台查询、验证、存储用户的个人信用信息，并输出给合作伙伴对用户的个人信用进行评估与参考使用。用户理解并同意，具体的授权查询、验证、存储及输出的内容以合作伙伴要求查询、验证、存储、输出以及技术开发方及其关联公司实际查询、验证、存储、输出的信息为准。技术开发方及其关联公司会在授权范围内对相关个人信息予以处理，但用户与合作伙伴之间因授权的有效性、授权内容、授权范围、授权期限等发生的争议纠纷与技术开发方无关。用户使用本服务的，即表明用户已明示对合作伙伴、技术开发方及其关联公司授权查询、验证、处理、存储、在约定范围内使用其个人信息，并对授权的效力、查询验证的内容、查询验证的平台、处理方式、使用范围等相关事项无任何事实或法律上的异议或争议。
      </p>
      <p>
        用户登录或使用本服务时起即视为用户与技术开发方的合作伙伴之间存在合法的、充分的、必要的、不可撤销的授权，且用户已清楚知晓其授权提供相关信息可能对其造成不利影响，如负面的信用评价等。为保护用户个人信息，技术开发方及其合作伙伴会采取合理措施对用户信息进行严格保密。
      </p>
      <div>一、协议主体</div>
      <p>本协议是用户与技术开发方关于用户使用本服务所订立的协议。</p>
      <div>二、关于本服务</div>
      <p>1、本服务内容是指技术开发方通过本应用程序向其他合作伙伴及用户提供的相关服务（简称“本服务”）。</p>
      <p>2、许可的范围</p>
      <p>（1）技术开发方授予用户一项个人的、不可转让及非排他性的许可、以使用本应用程序。</p>
      <p>（2）本协议其他条款未明示授权的其他一切知识产权仍由技术开发方保留。技术开发方如果未行使前述任何权利，并不构成对该权利的放弃。</p>

      <div>三、账号登录</div>
      <p>为使用本应用程序用户可能需要输入个人信息进行登录和使用。用户清楚知晓，其向技术开发方提供的账户仅限本人使用，否则，用户可能会对用户或他人造成侵权，用户承诺并同意，使用同一设备、同一身份证号或帐号使用本协议项下服务的，均视为用户本人的行为。用户应妥善保管好自己的信息，如用户违反本约定给用户或他人造成损失的，技术开发方不应也不会承担任何责任。</p>
      <div>四、用户个人信息保护</div>
      <p>1、技术开发方将会采取合理措施保护用户的个人信息、以免遭受未经授权的访问、使用或披露。</p>
      <p>2、因用户操作不当、遗忘或泄露密码、密码被他人破解、用户使用的计算机系统被第三方侵入、用户委托让人代理使用本服务时他人恶意或不当操作而造成的损失，由用户自行负责。</p>
      <div>五、授权事项及行为规范</div>
      <p>用户知晓并明示授权同意技术开发方及其关联公司依据相关的法律法规的规定，受合作伙伴委托向第三方正信机构或数据机构等合法查询、验证、审核用户信息，</p>
      <div>六、知识产权声明</div>
      <p>1、技术开发方是本应用程序的知识产权权利人。本应用程序的著作权、商标权、专利权、商业秘密等知识产权、以及与本应用程序相关的所有信息内容（包含但不限于文字、图片、音频、视频、图标、界面设计、版面框架、有关数据或电子文档等）均受中华人民共和国法律法规保护，技术开发方依法享有上述相关知识产权，但相关权利人依照法律规定应享有的权利除外。</p>
      <p>2、未经技术开发方书面同意，用户不得为任何商业或非商业目的的自行或许可任何第三方实施、利用、转让上述知识产权。</p>
      <div>七、终端安全责任</div>
      <span>在法律允许的范围内，技术开发方对以下情形导致的服务中断或受阻不承担责任：</span>
      <p>（1）受到计算机病毒、木马或其它恶意程序、黑客攻击的破坏；</p>
      <p>（2）用户或技术开发方的电脑软件、系统、硬件和通信线路出现故障；</p>
      <p>（3）用户操作不当；</p>
      <p>（4）用户通过非技术开发方授权的方式使用本服务；</p>
      <p>（5）其它技术开发方无法控制或合理预见的情形。</p>
      <div>八、其它</div>
      <p>1、用户使用本应用程序或本服务即视为用户已阅读并同意接受本协议的约束。技术开发方有权在必要时修改本协议条款。本协议条款变更后，如果用户继续登录、使用本服务的，即视为用户已接受修改后的协议。</p>
      <p>2、本协议的成立、生效、履行、解释及纠纷解决，试用中华人民共和国大陆地区法律（不包括冲突法）。</p>
      <p>3、本协议所有条款的标题仅为阅读方便，本身并无实际涵义，不能作为本协议涵义解释的依据。</p>
      <p>4、本协议条款无论因何种原因部分无效或不可执行，其余条款仍有效，对双方具有约束力。</p>





    </div>
  </div>
</template>

<script>
  export default {
    data(){
      return {}
    },
    methods: {},
    activated(){
      localStorage.setItem('headerTitle', '注册协议')
    }
  }
</script>

<style lang="scss">
  .loginDeal {
    text-align: left;
    line-height: .5rem;
    padding:1rem .3rem 0;
    .loginDealHeader{
      font-size:.4rem;
      font-weight:bold;
      text-align: center;
      line-height: 1rem;
    }
    div{
      font-size:.3rem;
      font-weight:bold;
    }
   p{
     text-indent: .7rem;
   }

  }
</style>
